export type MenuSection = { title: string; items: string[] }
export type MenuPackage = {
	slug: '65gel' | '85gel'
	name: string
	price: number
	perPersonLabel: string
	highlights: string[]
	sections: MenuSection[]
}

export const packages: MenuPackage[] = [
	{
		slug: '85gel',
		name: '85 ₾ პაკეტი',
		price: 85,
		perPersonLabel: 'ფასი ერთ სტუმარზე',
		highlights: [
			'ცხელი კერძები',
			'სალათები/ცივი ასორტი',
			'დესერტი',
			'სასმელები',
		],
		sections: [
			{
				title: 'ცხელი კერძები',
				items: [
					'გოჭი',
					'ქათამი',
					'ხაშლამა',
					'ბაჟე ქათმის',
					'ქათამი ტაბაკზე',
					'მწვადი ღორის',
					'ხბო ან ასიტრინის მწვადი',
					'კუჭ-მაჭი',
					'კუპატი',
					'ხორციანი რულეტი',
					'ხორციანი ბლინი',
					'მწყერი',
					'კალმახი',
					'სათალი',
				],
			},
			{
				title: 'ცივი ასორტი და სალათები',
				items: [
					'ფხალის ასორტი (ბადრიჯანი, ბულგარული, ისპანახი)',
					'მწვანილის თაიგული',
					'კიტრი-პომიდორი',
					'მჟავის ასორტი',
					'ქათმის სალათი',
					'ცეზარის სალათი',
					'სოკო კეცზე',
					'ყველის ასორტი (სულგუნი, შებოლილი სულგუნი, სულგუნის ფირფიტები ხაჭოთი)',
					'გებჟალია',
					'მეგრული ხაჭაპური',
					'აჩმა',
					'ხიზილალა',
					'ზეთისხილი',
				],
			},
			{
				title: 'დესერტი',
				items: [
					'ნამცხვარი',
					'ჟელატინი',
					'ქიშმიში-მიწისთხილი',
					'ნაყინი (მაწონი თაფლით და თხილით)',
				],
			},
			{
				title: 'პური',
				items: ['შოთის პური', 'ღომი', 'მჭადი', 'ელარჯი'],
			},
			{
				title: 'საწებელი',
				items: ['საწებელი პომიდვრის', 'ტყემალი'],
			},
			{
				title: 'ხილი',
				items: ['დაჭრილი ხილი (სეზონური)'],
			},
			{
				title: 'სასმელები',
				items: [
					'ლიმონათი (ზედაზენი)',
					'ნაბეღლავი',
					'ფანტა',
					'კოკა-კოლა',
					'წყალი',
					'ყავა და ჩაი',
				],
			},
		],
	},
	{
		slug: '65gel',
		name: '65 ₾ პაკეტი',
		price: 65,
		perPersonLabel: 'ფასი ერთ სტუმარზე',
		highlights: [
			'ცხელი კერძები',
			'სალათები/ცივი ასორტი',
			'დესერტი',
			'სასმელები',
		],
		sections: [
			{
				title: 'ცხელი კერძები',
				items: [
					'გოჭი',
					'ქათამი',
					'ბაჟე ქათმის',
					'ხაშლამა',
					'მწვადი ღორის',
					'კუჭ-მაჭი',
					'ხორციანი ბლინი',
				],
			},
			{
				title: 'ცივი ასორტი და სალათები',
				items: [
					'ქათმის სალათი',
					'ვინიგრეტი',
					'მწვანილის თაიგული',
					'კიტრი-პომიდორი',
					'მჟავის ასორტი',
					'ფხალის ასორტი (ბადრიჯანი, ბულგარული, ისპანახი)',
					'სოკო კეცზე',
					'ყველის ასორტი (სულგუნი, სულგუნის ფირფიტები ხაჭოთი)',
					'ხაჭაპური მეგრული',
					'აჩმა',
				],
			},
			{ title: 'დესერტი', items: ['ნამცხვარი', 'ქიშმიში-მიწისთხილი'] },
			{
				title: 'პური და წყლისფაფა',
				items: ['შოთის პური', 'მჭადი', 'ღომი', 'ელარჯი'],
			},
			{ title: 'საწებელი', items: ['ტყემალი', 'საწებელი პომიდვრის'] },
			{ title: 'ხილი', items: ['დაჭრილი ხილი (სეზონური)'] },
			{
				title: 'სასმელები',
				items: [
					'ლიმონათი (ზედაზენი)',
					'ნაბეღლავი',
					'ფანტა',
					'კოკა-კოლა',
					'წყალი',
					'ყავა და ჩაი',
				],
			},
		],
	},
]
